                //זו דוגמא להערה עם  עברית : remark
                dcl-s aString char(50);
                aString = 'מלל בעברית';
                aString = 'מלל נוסף בעברית'; //remak with עברית
                aString = 'english and עברית  and signs #%* וגם מספרים 12321'; //remark with עברית
                return;