**free
// German special characters in variables name 
dcl-s §var ind; // begin with \u00a7 paragraph symbol
§var = *on;
// German umlaut character in a literal
dsply 'Prüfexemplar';
return; 