     D fld2            s             20A   inz('即可加快进') ccsid(*JOBRUNMIX)COMMENT
     C     '即可加快进'cat       '即'        fld2                            COMMENT
     C                   SETON                                        LR 