
             DLTF       FILE(QTEMP/DETORD)
             MONMSG     MSGID(CPF0000)
             CRTDUPOBJ  OBJ(DETORD) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                          TOLIB(QTEMP) NEWOBJ(DETORD) CST(*NO) +
                          TRG(*NO)
             OVRDBF     FILE(TMPDETORD) TOFILE(QTEMP/DETORD)
             CALL       PGM(ORD100)
